#include <iostream>
#include <vector>
using namespace std;

vector<vector<pair<int,int>>> tetromino = {
    // 1. ㅡ (가로 4칸)
    {{0,0},{0,1},{0,2},{0,3}},
    // 2. ㅣ (세로 4칸)
    {{0,0},{1,0},{2,0},{3,0}},
    // 3. ㅁ (2x2)
    {{0,0},{0,1},{1,0},{1,1}},
    // 4. L (4가지 회전)
    {{0,0},{1,0},{2,0},{2,1}},
    {{0,0},{0,1},{0,2},{1,0}},
    {{0,0},{0,1},{1,1},{2,1}},
    {{1,0},{1,1},{1,2},{0,2}},
    // 5. 역 L (4가지 회전)
    {{0,0},{1,0},{2,0},{2,-1}},
    {{0,0},{0,1},{0,2},{1,2}},
    {{0,0},{0,1},{1,0},{2,0}},
    {{0,0},{1,0},{1,1},{1,2}},
    // 6. S (2가지 회전)
    {{0,0},{1,0},{1,1},{2,1}},
    {{1,0},{0,1},{1,1},{0,2}},
    // 7. 역 S (2가지 회전)
    {{0,0},{1,0},{1,-1},{2,-1}},
    {{0,0},{0,-1},{-1,-1},{-1,-2}},
    // 8. ㅗ (4가지 회전)
    {{0,0},{0,1},{0,2},{1,1}},
    {{0,1},{1,0},{1,1},{2,1}},
    {{1,0},{1,1},{1,2},{0,1}},
    {{0,0},{1,0},{1,1},{2,0}},
};


int main()
{
    int n, m, answer = 0;
    cin >> n >> m;

    vector<vector<int>> paper(n, vector<int>(m));
    for (int i = 0; i < n; i++)
        for (int j = 0; j < m; j++)
            cin >> paper[i][j];

    for (int i = 0; i < n; i++)
    {
        for (int j = 0; j < m; j++)
        {
            for (int k = 0; k < tetromino.size(); k++)
            {
                int sum = 0;
                for (int l = 0; l < 4; l++)
                {
                    int y = i + tetromino[k][l].first;
                    int x = j + tetromino[k][l].second;

                    if (x < 0 || x >= m || y < 0 || y >= n)
                    {
                        break;
                    }

                    sum += paper[y][x];
                }
                answer = max(answer, sum);
            }
        }
    }

    cout << answer << '\n';
}
